Repository: Eduardo-RFarias/CLAUCIA-app
Catalog: lib/l10n/app_*.arb
Languages: pt

source: Welcome Back!
pt: Bem-vindo de volta!

# signInToAccount
source: Sign in to your account
pt: Entre na sua conta

# enterEmail
source: Enter your email
pt: Digite seu e-mail

source: Password
pt: Senha

# enterPassword
source: Enter your password
pt: Digite sua senha

source: Sign In
pt: Entrar

# pleaseEnterEmail
source: Please enter your email
pt: Por favor, digite seu e-mail

# pleaseEnterValidEmail
source: Please enter a valid email
pt: Por favor, digite um e-mail válido

# pleaseEnterPassword
source: Please enter your password
pt: Por favor, digite sua senha

# passwordMinLength
source: Password must be at least 6 characters
pt: Senha deve ter pelo menos 6 caracteres

source: Demo Credentials
pt: Credenciais de Demonstração

# demoCredentialsInfo
source: You can use any of these demo accounts:
pt: Você pode usar qualquer uma dessas contas de demonstração:

source: View Demo Credentials
pt: Ver Credenciais de Demonstração

source: Home
pt: Início

source: Profile
pt: Perfil

source: Select Company
pt: Selecionar Empresa

source: Patients
pt: Pacientes

source: Age
pt: Idade

source: Medical Conditions
pt: Condições Médicas

source: Wounds
pt: Feridas

source: Add Wound
pt: Adicionar Ferida

source: samples
pt: Amostras

source: Add Sample
pt: Adicionar Amostra

source: Sample Details
pt: Detalhes da Amostra

source: Wagner Classification
pt: Classificação de Wagner

source: AI Classification
pt: Classificação IA

source: Professional Classification
pt: Classificação Profissional

source: Size Measurements
pt: Medidas de Tamanho

source: Length
pt: Comprimento

source: Width
pt: Largura

source: Edit
pt: Editar

source: Cancel
pt: Cancelar

source: Delete
pt: Excluir

source: Error
pt: Erro

source: Success
pt: Sucesso

source: Pending assessment
pt: Avaliação pendente

source: Update Classification
pt: Atualizar Classificação

source: Logout
pt: Sair

source: Change Password
pt: Alterar Senha

# deleteSampleConfirm
source: Are you sure you want to delete this sample?
pt: Tem certeza que deseja excluir esta amostra?

# deleteWoundConfirm
source: Are you sure you want to delete this wound and all its samples?
pt: Tem certeza que deseja excluir esta ferida?

source: Select Language
pt: Selecionar Idioma

source: Language
pt: Idioma

source: Security
pt: Segurança

source: Password and security settings
pt: Configurações de senha e segurança

source: Settings
pt: Configurações

source: Sign Out
pt: Sair

# areYouSureSignOut
source: Are you sure you want to sign out?
pt: Tem certeza de que deseja sair?

source: New Sample
pt: Nova Amostra

# captureNewSample
source: Capture a new sample to track wound progress
pt: Capture uma nova amostra para acompanhar o progresso da ferida

source: Wound Photo
pt: Foto da Ferida

source: Take Photo
pt: Tirar Foto

source: Gallery
pt: Galeria

source: Retake Photo
pt: Tirar Nova Foto

# enterWoundDimensions
source: Enter wound dimensions in centimeters
pt: Digite as dimensões da ferida em centímetros

source: Height (cm)
pt: Altura (cm)

source: Width (cm)
pt: Largura (cm)

# toggleSizeMeasurements
source: Toggle to add optional size measurements
pt: Ative para adicionar medidas opcionais de tamanho

source: Processing Sample...
pt: Processando Amostra...

source: Validation Error
pt: Erro de Validação

# providePhotoOrSize
source: Please provide either a photo or size measurements
pt: Por favor, forneça uma foto ou medidas de tamanho

# fillBothMeasurements
source: Please fill in both height and width measurements
pt: Por favor, preencha ambas as medidas de altura e largura

# enterValidNumbers
source: Please enter valid positive numbers for measurements
pt: Por favor, digite números positivos válidos para as medidas

# photoProcessed
source: Photo processed (224x224px)
pt: Foto processada (224x224px)

source: Current Password
pt: Senha Atual

# enterCurrentPassword
source: Enter your current password
pt: Digite sua senha atual

source: New Password
pt: Nova Senha

# enterNewPassword
source: Enter your new password
pt: Digite sua nova senha

source: Confirm New Password
pt: Confirmar Nova Senha

# confirmNewPasswordHint
source: Confirm your new password
pt: Confirme sua nova senha

# pleaseEnterCurrentPassword
source: Please enter your current password
pt: Por favor, digite sua senha atual

# pleaseEnterNewPassword
source: Please enter a new password
pt: Por favor, digite uma nova senha

# newPasswordDifferent
source: New password must be different from current password
pt: A nova senha deve ser diferente da senha atual

# pleaseConfirmPassword
source: Please confirm your new password
pt: Por favor, confirme sua nova senha

source: Passwords do not match
pt: Senhas não coincidem

source: Create New Patient
pt: Criar Novo Paciente

source: Add Photo (Optional)
pt: Adicionar Foto (Opcional)

source: Choose from Gallery
pt: Escolher da Galeria

source: Remove Photo
pt: Remover Foto

# fullNameRequired
source: Full Name *
pt: Nome Completo *

# enterPatientFullName
source: Enter patient's full name
pt: Digite o nome completo do paciente

# dateOfBirthRequired
source: Date of Birth *
pt: Data de Nascimento *

source: Select date of birth
pt: Selecione a data de nascimento

# biologicSexRequired
source: Biologic Sex *
pt: Sexo Biológico *

source: Select biologic sex
pt: Selecione o sexo biológico

source: Male
pt: Masculino

source: Female
pt: Feminino

# enterMedicalConditions
source: Enter any relevant medical conditions (optional)
pt: Digite condições médicas relevantes

# medicalConditionsHelper
source: Optional - e.g., diabetes, hypertension, etc.
pt: Opcional - Liste condições crônicas, alergias, medicamentos atuais, etc.

source: Create Patient
pt: Criar Paciente

source: * Required fields
pt: * Campos obrigatórios

# nameRequired
source: Name is required
pt: Nome é obrigatório

# nameMinLength
source: Name must be at least 2 characters
pt: Nome deve ter pelo menos 2 caracteres

# pleaseSelectDateOfBirth
source: Please select a date of birth
pt: Por favor, selecione uma data de nascimento

source: Please select biologic sex
pt: Por favor, selecione o sexo biológico

# biologicSexRequired2
source: Biologic sex is required
pt: Por favor selecione o sexo biológico

source: Create New Wound
pt: Criar Nova Ferida

source: Wound Information
pt: Informações da Ferida

# woundLocationRequired
source: Wound Location *
pt: Localização da Ferida *

# woundLocationHint
source: e.g., Left foot (plantar surface)
pt: ex: Pé esquerdo (superfície plantar)

# woundOriginRequired
source: Wound Origin *
pt: Por favor selecione a origem da ferida

source: Description (Optional)
pt: Descrição (Opcional)

# additionalWoundDetails
source: Additional details about the wound...
pt: Detalhes adicionais sobre a ferida...

source: Initial Sample
pt: Amostra Inicial

# captureFirstSample
source: Capture the first sample for this wound
pt: Capture a primeira amostra para esta ferida

source: Creating Wound...
pt: Criando Ferida...

source: Create Wound
pt: Criar Ferida

# pleaseEnterWoundLocation
source: Please enter the wound location
pt: Por favor, digite a localização da ferida

# locationMinLength
source: Location must be at least 3 characters
pt: Localização deve ter pelo menos 3 caracteres

# pleaseSelectWoundOrigin
source: Please select the wound origin
pt: Por favor, selecione a origem da ferida

source: Enter valid height
pt: Digite uma altura válida

source: Enter valid width
pt: Digite uma largura válida

# sizeMeasurementsOptional
source: Size measurements are optional. Enable to add measurements.
pt: Medidas de tamanho são opcionais. Ative para adicionar medidas.

# welcomeBack2
source: Welcome back
pt: Bem-vindo de volta

source: patients registered
pt: pacientes registrados

source: New Patient
pt: Novo Paciente

source: Error loading patients
pt: Erro ao carregar pacientes

source: Try Again
pt: Tente Novamente

source: No patients found
pt: Nenhum paciente encontrado

# addFirstPatientMessage
source: Add your first patient to get started
pt: Comece adicionando seu primeiro paciente para iniciar o monitoramento de feridas.

source: Add First Patient
pt: Adicionar Primeiro Paciente

source: Has medical conditions
pt: Possui condições médicas

source: Today
pt: Hoje

source: Yesterday
pt: Ontem

# daysAgo
source: {count} days ago
pt: {count} dias atrás

source: Company Selected
pt: Empresa Selecionada

source: Now working with
pt: Agora trabalhando com

source: Basic Information
pt: Informações Básicas

source: Date of Birth
pt: Data de Nascimento

source: Biologic Sex
pt: Sexo Biológico

source: No medical conditions recorded
pt: Nenhuma condição médica registrada

source: No wounds recorded
pt: Nenhuma ferida registrada

# woundsProgressMessage
source: Wounds and their treatment progress will appear here
pt: Feridas e seu progresso de tratamento aparecerão aqui

source: Patient History
pt: Histórico do Paciente

source: Created
pt: Criado

source: Last Updated
pt: Última Atualização

source: Latest Sample
pt: Última Amostra

source: Size
pt: Tamanho

source: sample
pt: amostra

source: No samples recorded
pt: Nenhuma amostra registrada

source: Delete Patient
pt: Excluir Paciente

# areYouSureDeletePatient
source: Are you sure you want to delete this patient?
pt: Tem certeza que deseja excluir este paciente?

# deleteWoundsAndSamples
source: This will also delete all {woundsCount} wounds and {samplesCount} samples.
pt: Isso também excluirá {woundsCount} feridas e {samplesCount} amostras.

# actionCannotBeUndone
source: This action cannot be undone.
pt: Esta ação não pode ser desfeita.

# patientDeletedSuccessfully
source: Patient {patientName} deleted successfully
pt: {patientName} foi excluído com sucesso.

source: Failed to delete patient
pt: Falha ao excluir paciente

source: Reviewed
pt: Revisado

source: Pending Review
pt: Pendente de Revisão

source: Sample Date
pt: Data da Amostra *

source: Time Since
pt: Tempo Desde

source: Review
pt: Revisar

source: Automatic analysis
pt: Análise automática

source: No AI Classification
pt: Nenhuma Classificação IA

# photoRequiredForAnalysis
source: Photo required for AI analysis
pt: Foto necessária para análise de IA

source: Professional Review
pt: Revisão Profissional

source: Clinical assessment
pt: Avaliação clínica

source: Awaiting Professional Review
pt: Aguardando Revisão Profissional

# clickReviewToAdd
source: Click review to add clinical assessment
pt: Clique em revisar para adicionar avaliação clínica

source: ACTIVE
pt: ATIVO

source: Wound Measurements
pt: Medidas da Ferida

source: Dimensions
pt: Dimensões

source: Area
pt: Área

source: Responsible Professional
pt: Profissional Responsável

source: Sample Information
pt: Informações da Amostra

source: Sample ID
pt: ID da Amostra

source: Wound ID
pt: ID da Ferida

# aiClassificationColon
source: AI Classification:
pt: Classificação IA:

# notAvailableNoPhoto
source: Not available (no photo provided)
pt: Não disponível (sem foto)

source: Professional Assessment:
pt: Avaliação Profissional

source: Update
pt: Atualizar

source: Delete Sample
pt: Excluir Amostra

source: Sample deleted successfully
pt: Amostra excluída com sucesso!

source: Failed to delete sample
pt: Falha ao excluir amostra

source: Wound Details
pt: Detalhes da Ferida

source: Sample History
pt: Histórico de Amostras

source: No samples yet
pt: Nenhuma amostra registrada ainda

# startDocumentingWound
source: Start documenting this wound's healing progress by adding samples
pt: Comece a documentar o progresso de cicatrização desta ferida adicionando amostras

source: Add First Sample
pt: Adicionar Primeira Amostra

source: Latest
pt: Mais Recente

source: No photo
pt: Sem foto

source: Delete Wound
pt: Excluir Ferida

source: Wound deleted successfully
pt: Ferida excluída com sucesso!

source: Failed to delete wound
pt: Falha ao excluir ferida

source: No user data available
pt: Nenhum dado de usuário disponível

source: User Information
pt: Informações do Usuário

source: Full Name
pt: Nome Completo

source: Email Address
pt: Endereço de Email

source: User ID
pt: ID do Usuário

source: Account Status
pt: Status da Conta

source: About
pt: Sobre

source: About This App
pt: Sobre Este App

# appDescription
source: Claucia is a modern Flutter application built with GetX for state management. This app demonstrates authentication, profile management, and clean architecture patterns.
pt: Claucia é uma aplicação Flutter moderna construída com GetX para gerenciamento de estado. Este app demonstra autenticação, gerenciamento de perfil e padrões de arquitetura limpa.

source: Version
pt: Versão

source: Take a Photo
pt: Tirar uma Foto

source: Failed to pick image
pt: Falha ao selecionar imagem

source: Failed to create sample
pt: Falha ao criar amostra

# welcomeBackUser
source: Welcome back, {userName}!
pt: Bem-vindo de volta, {userName}!

source: Login Failed
pt: Login Falhou

source: Logged Out
pt: Desconectado

source: You have been logged out successfully
pt: Você foi desconectado com sucesso

# logoutFailed
source: Logout failed: {error}
pt: Falha ao desconectar: {error}

source: Profile picture updated successfully
pt: Foto de perfil atualizada com sucesso

source: Password changed successfully
pt: Senha alterada com sucesso!

# failedToLoadPatients
source: Failed to load patients: {error}
pt: Falha ao carregar pacientes: {error}

# patientCreatedSuccessfully
source: Patient {patientName} created successfully
pt: Paciente criado com sucesso!

# failedToCreatePatient
source: Failed to create patient: {error}
pt: Falha ao criar paciente: {error}

# failedToLoadWounds
source: Failed to load wounds: {error}
pt: Falha ao carregar feridas: {error}

source: Wound created successfully
pt: Ferida criada com sucesso!

# failedToCreateWound
source: Failed to create wound: {error}
pt: Falha ao criar ferida: {error}

# failedToLoadSamples
source: Failed to load samples: {error}
pt: Falha ao carregar amostras: {error}

# yearsOld
source: {count} years old
pt: {count} anos

# statusActive
source: Active
pt: Ativa

# statusHealed
source: Healed
pt: Cicatrizada

source: day
pt: dia

source: just now
pt: agora mesmo

source: Diabetic Ulcers
pt: Úlceras Diabéticas

source: Non-Diabetic Ulcers
pt: Úlceras Não-Diabéticas

source: Neuropathic Ulcers
pt: Úlceras Neuropáticas

source: Venous Ulcers
pt: Úlceras Venosas

# wagnerGrade0
source: No open Lesion
pt: Nenhuma lesão aberta; pode ter deformidade ou celulite

# wagnerGrade1
source: Superficial Lesion
pt: Úlcera superficial sem penetração em camadas mais profundas

# wagnerGrade2
source: Deep Ulcer
pt: Úlcera profunda penetrando até tendão, osso ou cápsula articular

# wagnerGrade3
source: Abscess/Osteomyelitis
pt: Úlcera profunda com osteomielite, abscesso ou sepse articular

# wagnerGrade4
source: Partial Foot Gangrene
pt: Gangrena localizada do antepé ou calcanhar

# wagnerGrade5
source: Whole Foot Gangrene
pt: Gangrena extensa de todo o pé

# createdTime
source: Created
pt: Criado há

source: Grade
pt: Grau

# cm2Unit
source: cmÂ²
pt: cm²

# sampleNumber
source: Sample
pt: Amostra #

# weekAgo
source: 1 week ago
pt: 1 semana atrás

# weeksAgo
source: {count} weeks ago
pt: {count} semanas atrás

# monthAgo
source: 1 month ago
pt: 1 mês atrás

# monthsAgo
source: {count} months ago
pt: {count} meses atrás

# yearAgo
source: 1 year ago
pt: 1 ano atrás

# yearsAgo
source: {count} years ago
pt: {count} anos atrás

# hourAgo
source: 1 hour ago
pt: 1 hora atrás

# hoursAgo
source: {count} hours ago
pt: {count} horas atrás

# minuteAgo
source: 1 minute ago
pt: 1 minuto atrás

# minutesAgo
source: {count} minutes ago
pt: {count} minutos atrás
